Австралия/src/AccumulationRegisters/ProductionComponents/ProductionComponents.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ProductionComponents</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ProductionDocument</name>
    <type>
      <types>DocumentRef.ProductionOrder</types>
      <types>DocumentRef.ManufacturingOperation</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Products</name>
    <type>
      <types>CatalogRef.Products</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Characteristic</name>
    <type>
      <types>CatalogRef.ProductsCharacteristics</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Австралия/src/Enums/OperationTypesProductionOrder/OperationTypesProductionOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>OperationTypesProductionOrder</name>
  <enumValues>
    <name>Assembly</name>
  </enumValues>
  <enumValues>
    <name>Disassembly</name>
  </enumValues>
  <enumValues>
    <name>AssemblyDisassembly</name>
  </enumValues>
  <enumValues>
    <name>Production</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ManufacturingOperationStatuses/ManufacturingOperationStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ManufacturingOperationStatuses</name>
  <enumValues>
    <name>Open</name>
  </enumValues>
  <enumValues>
    <name>InProcess</name>
  </enumValues>
  <enumValues>
    <name>Completed</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Enums/ProductionMethods/ProductionMethods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ProductionMethods</name>
  <enumValues>
    <name>InHouseProduction</name>
  </enumValues>
  <enumValues>
    <name>Subcontracting</name>
  </enumValues>
</mdclass:Enum>

Австралия/src/Documents/ProductionOrder/ProductionOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProductionOrder</name>
  <basedOn>Document.SalesOrder</basedOn>
  <basedOn>Document.ProductionOrder</basedOn>
  <basedOn>Document.SubcontractorOrderReceived</basedOn>
  <registerRecords>AccumulationRegister.ManufacturingProcessSupply</registerRecords>
  <registerRecords>AccumulationRegister.ProductionOrders</registerRecords>
  <registerRecords>AccumulationRegister.ProductionComponents</registerRecords>
  <registerRecords>AccumulationRegister.InventoryDemand</registerRecords>
  <registerRecords>AccumulationRegister.ReservedProducts</registerRecords>
  <registerRecords>AccumulationRegister.ProductRelease</registerRecords>
  <registerRecords>AccumulationRegister.Backorders</registerRecords>
  <registerRecords>AccumulationRegister.InventoryFlowCalendar</registerRecords>
  <attributes>
    <name>OperationKind</name>
    <type>
      <types>EnumRef.OperationTypesProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnit</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>StructuralUnitReserve</name>
    <type>
      <types>CatalogRef.BusinessUnits</types>
    </type>
  </attributes>
  <attributes>
    <name>Comment</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>BasisDocument</name>
    <type>
      <types>DocumentRef.SubcontractorOrderIssued</types>
      <types>DocumentRef.SalesOrder</types>
      <types>DocumentRef.SubcontractorOrderReceived</types>
      <types>DocumentRef.ProductionOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>OrderState</name>
    <type>
      <types>CatalogRef.ProductionOrderStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Closed</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Responsible</name>
    <type>
      <types>CatalogRef.Employees</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ProductsList</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Priority</name>
    <type>
      <types>CatalogRef.ProductionOrdersPriorities</types>
    </type>
  </attributes>
  <attributes>
    <name>UseProductionPlanning</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>SalesOrderPosition</name>
    <type>
      <types>EnumRef.AttributeStationing</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Products</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>ProductsType</name>
      <type>
        <types>EnumRef.ProductsTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Inventory</name>
    <attributes>
      <name>Products</name>
      <type>
        <types>CatalogRef.Products</types>
      </type>
    </attributes>
    <attributes>
      <name>Characteristic</name>
      <type>
        <types>CatalogRef.ProductsCharacteristics</types>
      </type>
    </attributes>
    <attributes>
      <name>Batch</name>
      <type>
        <types>CatalogRef.ProductsBatches</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reserve</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>MeasurementUnit</name>
      <type>
        <types>CatalogRef.UOMClassifier</types>
        <types>CatalogRef.UOM</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
        <types>DocumentRef.SubcontractorOrderReceived</types>
      </type>
    </attributes>
    <attributes>
      <name>Specification</name>
      <type>
        <types>CatalogRef.BillsOfMaterials</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AdditionalAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AdditionalAttributesAndInfo</types>
      </type>
    </attributes>
    <attributes>
      <name>TextString</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Австралия/src/AccumulationRegisters/ProductionComponents/ManagerModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Internal

Procedure CreateEmptyTemporaryTableChange(AdditionalProperties) Export
	
	If Not AdditionalProperties.Property("ForPosting")
		Or Not AdditionalProperties.ForPosting.Property("StructureTemporaryTables") Then
		Return;
	EndIf;
	
	StructureTemporaryTables = AdditionalProperties.ForPosting.StructureTemporaryTables;
	
	Query = New Query(
	"SELECT TOP 0
	|	ProductionComponents.LineNumber AS LineNumber,
	|	ProductionComponents.Products AS Products,
	|	ProductionComponents.Characteristic AS Characteristic,
	|	ProductionComponents.ProductionDocument AS ProductionDocument,
	|	ProductionComponents.Quantity AS QuantityBeforeWrite,
	|	ProductionComponents.Quantity AS QuantityChange,
	|	ProductionComponents.Quantity AS QuantityOnWrite
	|INTO RegisterRecordsProductionComponentsChange
	|FROM
	|	AccumulationRegister.ProductionComponents AS ProductionComponents");
	
	Query.TempTablesManager = StructureTemporaryTables.TempTablesManager;
	QueryResult = Query.Execute();
	
	StructureTemporaryTables.Insert("RegisterRecordsProductionComponentsChange", False);
	
EndProcedure

Function BalancesControlQueryText() Export
	
	Return
	"SELECT ALLOWED
	|	RegisterRecordsProductionComponentsChange.LineNumber AS LineNumber,
	|	RegisterRecordsProductionComponentsChange.ProductionDocument AS ProductionDocument,
	|	RegisterRecordsProductionComponentsChange.Products AS Products,
	|	CatalogProducts.MeasurementUnit AS MeasurementUnit,
	|	RegisterRecordsProductionComponentsChange.Characteristic AS Characteristic,
	|	RegisterRecordsProductionComponentsChange.QuantityChange + ISNULL(ProductionComponentsBalances.QuantityBalance, 0) AS QuantityBalanceBeforeChange,
	|	ISNULL(ProductionComponentsBalances.QuantityBalance, 0) AS QuantityBalance
	|FROM
	|	RegisterRecordsProductionComponentsChange AS RegisterRecordsProductionComponentsChange
	|		LEFT JOIN Catalog.Products AS CatalogProducts
	|		ON RegisterRecordsProductionComponentsChange.Products = CatalogProducts.Ref
	|		LEFT JOIN AccumulationRegister.ProductionComponents.Balance(&ControlTime, ) AS ProductionComponentsBalances
	|		ON RegisterRecordsProductionComponentsChange.ProductionDocument = ProductionComponentsBalances.ProductionDocument
	|			AND RegisterRecordsProductionComponentsChange.Products = ProductionComponentsBalances.Products
	|			AND RegisterRecordsProductionComponentsChange.Characteristic = ProductionComponentsBalances.Characteristic
	|WHERE
	|	ISNULL(ProductionComponentsBalances.QuantityBalance, 0) < 0
	|
	|ORDER BY
	|	LineNumber";
	
EndFunction

#Region InfobaseUpdate

Procedure FillRecords() Export
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	ProductionOrder.Ref AS Ref
	|FROM
	|	Document.ProductionOrder AS ProductionOrder
	|		LEFT JOIN AccumulationRegister.ProductionComponents AS ProductionComponents
	|		ON ProductionOrder.Ref = ProductionComponents.Recorder
	|WHERE
	|	(ProductionOrder.OperationKind = VALUE(Enum.OperationTypesProductionOrder.Assembly)
	|			OR ProductionOrder.OperationKind = VALUE(Enum.OperationTypesProductionOrder.Disassembly))
	|	AND ProductionOrder.Posted
	|	AND ProductionComponents.Recorder IS NULL
	|
	|UNION ALL
	|
	|SELECT
	|	ManufacturingOperation.Ref
	|FROM
	|	Document.ManufacturingOperation AS ManufacturingOperation
	|		LEFT JOIN AccumulationRegister.ProductionComponents AS ProductionComponents
	|		ON ManufacturingOperation.Ref = ProductionComponents.Recorder
	|WHERE
	|	ManufacturingOperation.Posted
	|	AND ProductionComponents.Recorder IS NULL
	|	AND (ManufacturingOperation.Status = VALUE(Enum.ManufacturingOperationStatuses.InProcess)
	|			OR ManufacturingOperation.Status = VALUE(Enum.ManufacturingOperationStatuses.Completed))
	|	AND ManufacturingOperation.ProductionMethod = VALUE(Enum.ProductionMethods.InHouseProduction)
	|
	|UNION ALL
	|
	|SELECT
	|	Manufacturing.Ref
	|FROM
	|	Document.Manufacturing AS Manufacturing
	|		LEFT JOIN AccumulationRegister.ProductionComponents AS ProductionComponents
	|		ON Manufacturing.Ref = ProductionComponents.Recorder
	|WHERE
	|	Manufacturing.Posted
	|	AND ProductionComponents.Recorder IS NULL";
	
	QueryResult = Query.Execute();
	
	SelectionDocument = QueryResult.Select();
	
	While SelectionDocument.Next() Do
		
		DocumentRef = SelectionDocument.Ref;
		
		BeginTransaction();
		
		Try
			
			DocumentObject = DocumentRef.GetObject();
			
			DocumentMetadata = DocumentObject.Metadata();
			
			DriveServer.InitializeAdditionalPropertiesForPosting(DocumentRef, DocumentObject.AdditionalProperties);
			Documents[DocumentMetadata.Name].InitializeDocumentData(DocumentRef, DocumentObject.AdditionalProperties);
			
			DriveServer.ReflectProductionComponents(DocumentObject.AdditionalProperties, DocumentObject.RegisterRecords, False);
			InfobaseUpdate.WriteRecordSet(DocumentObject.RegisterRecords.ProductionComponents);
			
			DocumentObject.AdditionalProperties.ForPosting.StructureTemporaryTables.TempTablesManager.Close();
			
			InfobaseUpdate.WriteObject(DocumentObject);
			
			CommitTransaction();
			
		Except
			
			RollbackTransaction();
			
			ErrorDescription = StringFunctionsClientServer.SubstituteParametersToString(
				NStr("en = 'Couldn''t save %1: %2'; ru = 'Не удалось записать %1: %2';pl = 'Nie udało się zapisać %1: %2';es_ES = 'No se ha podido guardar %1:%2';es_CO = 'No se ha podido guardar %1:%2';tr = '%1 saklanamadı: %2';it = 'Impossibile salvare %1: %2';de = 'Fehler beim Speichern von %1: %2'", CommonClientServer.DefaultLanguageCode()),
				DocumentRef,
				BriefErrorDescription(ErrorInfo()));
			
			WriteLogEvent(
				NStr("en = 'Infobase update'; ru = 'Обновление информационной базы';pl = 'Aktualizacja bazy informacyjnej';es_ES = 'Actualización de la infobase';es_CO = 'Actualización de la infobase';tr = 'Infobase güncellemesi';it = 'Aggiornamento del database';de = 'Infobase-Aktualisierung'", CommonClientServer.DefaultLanguageCode()),
				EventLogLevel.Error,
				DocumentMetadata,
				,
				ErrorDescription);
			
		EndTry;
		
	EndDo;
	
EndProcedure

#EndRegion

#EndRegion

#EndIf
